tap "cartr/qt4"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "iterative/dvc"
tap "kryptco/tap"
tap "michaeleisel/zld"
tap "nektos/tap"
tap "nyuichi/satysfi"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "ray851107/iguanatexmac", "git@github.com:ray851107/iguanatexmac"
tap "uetchy/nlp"
tap "vapor/tap"
brew "act"
brew "ca-certificates"
brew "gcc"
brew "xz"
brew "python@3.9"
brew "apache-arrow"
brew "autoconf"
brew "automake"
brew "avrdude"
brew "awscli"
brew "glib"
brew "tcl-tk"
brew "gobject-introspection"
brew "harfbuzz"
brew "binwalk"
brew "boost"
brew "bzip2"
brew "cabextract"
brew "mecab"
brew "mecab-ipadic"
brew "cabocha"
brew "chrony"
brew "clang-format"
brew "clisp"
brew "cmake"
brew "colordiff"
brew "curl"
brew "libpq"
brew "pcre2"
brew "composer"
brew "coq"
brew "coreutils"
brew "cscope"
brew "cuetools"
brew "deno"
brew "openjdk"
brew "dex2jar"
brew "dfu-programmer"
brew "dfu-util"
brew "docker", link: false
brew "doxygen"
brew "dvc"
brew "editorconfig"
brew "espeak"
brew "exiftool"
brew "ext4fuse"
brew "guile"
brew "libass"
brew "ffmpeg"
brew "fish"
brew "fswatch"
brew "gcal"
brew "gdb"
brew "gdrive"
brew "ghostscript"
brew "git"
brew "git-filter-repo"
brew "pango"
brew "gnuplot"
brew "go"
brew "gradle"
brew "gradle-completion"
brew "graphviz"
brew "grep"
brew "grip"
brew "haskell-language-server"
brew "haskell-stack"
brew "htop"
brew "hugo"
brew "libheif"
brew "python@3.8"
brew "imagemagick"
brew "irssi"
brew "jadx"
brew "jenv"
brew "jq"
brew "jumanpp"
brew "kotlin"
brew "libsoundio"
brew "lsyncd"
brew "luarocks"
brew "luv"
brew "lynx"
brew "mackup"
brew "mas"
brew "maven"
brew "maxima"
brew "mercurial"
brew "meson"
brew "mono"
brew "n"
brew "neovim", args: ["HEAD"]
brew "nkf"
brew "nmap"
brew "openjdk@11"
brew "pdftk-java"
brew "php@7.3"
brew "phpbrew"
brew "pipenv"
brew "poetry"
brew "poppler"
brew "pstree"
brew "putty"
brew "pwgen"
brew "pyenv"
brew "pygments", link: false
brew "qpdf"
brew "rclone"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rsync"
brew "rtaudio"
brew "ruby"
brew "rustup-init"
brew "saml2aws"
brew "sbt"
brew "sdl"
brew "sdl2_gfx"
brew "sdl2_image"
brew "sdl2_mixer"
brew "sdl2_ttf"
brew "sdl_gfx"
brew "sdl_image"
brew "sdl_mixer"
brew "sdl_ttf"
brew "shntool"
brew "sphinx"
brew "swig"
brew "tmux"
brew "transmission-cli"
brew "trash"
brew "tree"
brew "unar"
brew "unrar"
brew "vcpkg"
brew "vim"
brew "w3m"
brew "watchman"
brew "wget"
brew "wxmaxima"
brew "youtube-dl"
brew "zlib"
brew "zola"
brew "kryptco/tap/kr"
brew "michaeleisel/zld/zld"
brew "osx-cross/arm/arm-gcc-bin@8", link: true
brew "osx-cross/avr/avr-gcc@8", link: true
brew "qmk/qmk/qmk"
brew "uetchy/nlp/knp"
brew "vapor/tap/vapor"
cask "alacritty"
cask "alfred"
cask "android-studio"
cask "atom"
cask "bettertouchtool"
cask "chromedriver"
cask "chromium"
cask "clion"
cask "coqide"
cask "docker"
cask "firefox"
cask "font-hackgen-nerd"
cask "genymotion"
cask "gimp"
cask "google-chrome"
cask "google-japanese-ime"
cask "grandperspective"
cask "hex-fiend"
cask "horndis"
cask "inkscape"
cask "iterm2"
cask "java"
cask "java11"
cask "java8"
cask "julia"
cask "keepassxc"
cask "keepingyouawake"
cask "keycastr"
cask "libreoffice"
cask "mapture"
cask "microsoft-remote-desktop"
cask "middleclick"
cask "mono-mdk-for-visual-studio"
cask "musescore"
cask "noxappplayer"
cask "obs"
cask "obs-virtualcam"
cask "postman"
cask "processing"
cask "protege"
cask "r"
cask "rstudio"
cask "skim"
cask "slack"
cask "soundsource"
cask "sourcetree"
cask "sqlworkbenchj"
cask "tabula"
cask "unity-hub"
cask "vagrant"
cask "vesta"
cask "virtualbox"
cask "visual-studio"
cask "visual-studio-code"
cask "wireshark"
cask "xld"
mas "CommentScreen", id: 1450950860
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "ToyViewer", id: 414298354
mas "Xcode", id: 497799835
